app/Controllers/Clientes.php

    public function index($activo =1){

        $clientes = $this->clientes->where('activo', $activo)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1