app/Controllers/Configuracion.php

SELECT *
FROM `configuracion`
WHERE `activo` = 1
---
    public function index( $activo =1){
        $config = $this->configuracion->where('activo', $activo)->findAll();

SELECT *
FROM `configuracion`
WHERE `id` = '1'
 LIMIT 1
---
    public function editar($id, $valid=null){

        $config = $this->configuracion->where('id', $id)->first();

UPDATE `configuracion` SET `nombre` = 'Gracias Por su compra!!!', `Tiket_leyenda` = NULL, `Tienda_rfc` = 'xxxx0000xxxx', `Tienda_telefono` = '3506455676', `Tienda_email` = 'pizzeria_Iba@gmail.com', `Tienda_direccion` = 'Av Nestor Kirchner al 6000', `fecha_edit` = '2023-11-08 21:14:04'
WHERE `configuracion`.`id` IN ('1')
---
    public function actualizar(){

        if ($this->request->getMethod()=="post" && $this->validate($this->reglas)) {
            $this->configuracion->update($this->request->getPost('id'), [
                'nombre' => $this->request->getPost('nombre'),
            'Tiket_leyenda' => $this->request->getPost('Tiket_leyenda'),
            'Tienda_rfc' => $this->request->getPost('Tienda_rfc'),
            'Tienda_telefono' => $this->request->getPost('Tienda_telefono'),
            'Tienda_email' => $this->request->getPost('Tienda_email'),
            'Tienda_direccion' => $this->request->getPost('Tienda_direccion'),
            ]);