app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `estado` = 1
---
    public function index( $estado =1){

        $productos = $this->productos->where('estado', $estado)->findAll();

UPDATE `productos` SET `estado` = 0, `fecha_edit` = '2023-10-30 18:54:26'
WHERE `productos`.`id` IN ('8')
---
        public function eliminar($id){

            $this->productos->update($id, ['estado' =>0]);