app/Controllers/Unidades.php

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function index( $activo =1){

        $unidades = $this->unidades->where('activo', $activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function eliminados ($activo =0){

        $unidades = $this->unidades->where('activo', $activo)->findAll();

UPDATE `unidades` SET `activo` = 1, `fecha_edit` = '2023-10-30 18:43:28'
WHERE `unidades`.`id` IN ('5')
---
    public function reingresar($id){

        $this->unidades->update($id, ['activo' =>1]);

UPDATE `unidades` SET `activo` = 0, `fecha_edit` = '2023-10-29 19:38:54'
WHERE `unidades`.`id` IN ('5')
---
        public function eliminar($id){

            $this->unidades->update($id, ['activo' =>0]);