app/Controllers/Usuarios.php

    public function reingresar($id){

        $this->usuarios->update($id, ['activo' =>1]);
---
UPDATE `usuario` SET `activo` = 1, `fecha_modifica` = '2023-11-13 17:33:53'
WHERE `usuario`.`id_usuario` IN ('3')

     public function cambiaPassword($activo =1){
        $session = session();
        // $session->set($data);
        $usuario = $this->usuarios->where('activo', $activo)->first();
---
SELECT *
FROM `usuario`
WHERE `activo` = 1
 LIMIT 1

     public function actualizar_pass($activo =1){
        if ($this->request->getMethod()=="post" && $this->validate($this->reglasCambia)) {
            $sesion = session();
            $idUsuario = $sesion->id_usuario;

 $hash= password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

            $this->usuarios->update($this->request->getPost($idUsuario),
            [
                'password' => $hash,
                'type' => $this->request->getPost('type'),

        ]);

       // $usuario = $this->usuarios->where('id_usuario', $sesion->id_usuario)->first();
        $usuario = $this->usuarios->where('activo', $activo)->first();
---
UPDATE `usuario` SET `password` = '$2y$10$6YNJ7UKRX86xyQ4XCe8vZucJQWtXyh613igghkBSu6hk9BuDGxtNi', `type` = 'cliente', `fecha_modifica` = '2023-11-13 17:59:32'
WHERE `usuario`.`id_usuario` IN ('123','cliente')
SELECT *
FROM `usuario`
WHERE `activo` = 1
 LIMIT 1