app/Models/CrudModel.php

        public function insertar($datos){
            $Nombres = $this->db->table('productos');
            $Nombres->insert($datos);
---
INSERT INTO `productos` (`nombre`, `descripcion`, `imagen`, `cantidad`, `precio`) VALUES ('', '', '', '', '')

        public function actualizar($data, $id){
            $Nombres = $this->db->table('productos');
            $Nombres->set($data);

            $Nombres->where('id', $id);
            return $Nombres->update();
---
UPDATE `productos` SET `nombre` = 'combo 2', `descripcion` = 'hamburguesa mas vaso de coca', `imagen` = 'combo2.png', `cantidad` = '12', `precio` = '1050'
WHERE `id` = '6'