app/Models/Usuarios.php

        public function obtenerUsuario($data){
            $Usuario = $this->db->table('usuario');
            $Usuario-> where($data);

            return $Usuario->get()->getResultArray();
---
SELECT *
FROM `usuario`
WHERE `usuario` = 'carlos'